tsung_logs/authenticated_users_get_tweets_unoptimized_run_1/20211125-2125/authenticated_user_get_tweets_flow.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="nikunjbaid2.eba-mpffqwyy.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="300000"/>
  </options>

  <sessions>
    <session name="user_tweets" type="ts_http" weight="1">

      <transaction name="login">

        <request>
          <dyn_variable name="authenticity_token"/>
          <http method="GET" url="/users/sign_in"/>
        </request>

        <thinktime value="1" random="true"/>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval"> <var name="authenticity_token"/> </setdynvars>

        <request subst="true">
          <http url="/users/sign_in" version="1.1" method="POST" contents="user[email]=cool_guy@mail.com&amp;authenticity_token=%%_authenticity_token%%&amp;                       user[password]=11111111&amp;commit=Log+in" content_type="application/x-www-form-urlencoded">
          </http>
        </request>

        <request subst="true">
          <http url="/tweets" version="1.1" method="GET" contents="authenticity_token=%%_authenticity_token%%" content_type="application/x-www-form-urlencoded">
          </http>
        </request>

      </transaction>

    </session>
  </sessions>

  </tsung>